Repository: JordyHers-org/Times-up-flutter
Catalog: lib/l10n/arb/app_*.arb
Languages: de, es, fr, tr

source: Welcome
de: Willkommen!
es: ¡Bienvenido!
fr: Bienvenue
tr: Hoş geldiniz!

# hello
source: Hello ðŸ‘‹
de: Hallo 👋
es: ¡Hola 👋!
fr: Salut 👋
tr: Merhaba 👋

source: Today
de: Heute
es: Hoy
fr: Aujourd'hui
tr: Bugün

# notificationSub
source: slide from right to left to dismiss
de: Schieben Sie von rechts nach links zum Schließen
es: Deslice de derecha a izquierda para descartar
fr: Glissez de droite à gauche pour ignorer
tr: Kapatmak için sağdan sola kaydırın

source: change the settings here
de: Ändern Sie die Einstellungen hier
es: Cambiar la configuración aquí
fr: Modifier les paramètres ici
tr: Ayarları burada değiştirin

# addNewChildHere
source: Add a new child here
de: Ein neues Kind hinzufügen hier
es: Agregar un nuevo niño aquí
fr: Ajouter un nouvel enfant ici
tr: Yeni bir çocuk ekleyin burada

source: Operation failed
de: Vorgang fehlgeschlagen
es: Operación fallida
fr: Opération échouée
tr: İşlem başarısız

# enterThisCode
source: Enter this code on the child's device
de: Geben Sie diesen Code auf dem Gerät des Kindes ein
es: Ingresa este código en el dispositivo del niño
fr: Saisir ce code sur l'appareil de l'enfant
tr: Bu kodu çocuğun cihazına girin

source: Long press to copy or double tap to share
de: Lange drücken zum Kopieren oder doppelt tippen zum Teilen
es: Mantén presionado para copiar o toca dos veces para compartir
fr: Appuyez longuement pour copier ou double-cliquez pour partager
tr: Kopyalamak için uzun basın veya paylaşmak için çift dokunun

# enterThisCodeOnChildDevice
source: Enter this code on child's device:
de: Geben Sie diesen Code auf dem Gerät des Kindes ein:
es: Ingresa este código en el dispositivo del niño:
fr: Saisir ce code sur l'appareil de l'enfant :
tr: Bu kodu çocuğun cihazına girin:

# sendNotificationToYourChildDevice
source: Send notifications to your Child's device
de: Benachrichtigungen an das Gerät Ihres Kindes senden
es: Enviar notificaciones al dispositivo de tu hijo
fr: Envoyer des notifications à l'appareil de votre enfant
tr: Çocuğunuzun cihazına bildirim gönderin

# copyText
source: Code Copied!
de: Code kopiert!
es: ¡Código copiado!
fr: Code copié !
tr: Kod Kopyalandı!

source: My Children
de: Meine Kinder
es: Mis hijos
fr: Mes enfants
tr: Çocuklarım

# myChildrenSub
source: Choose child to get more info - scroll right
de: Wählen Sie ein Kind aus, um weitere Informationen zu erhalten - nach rechts wischen
es: Selecciona un niño para obtener más información - desliza a la derecha
fr: Sélectionnez un enfant pour obtenir plus d'informations - faites défiler vers la droite
tr: Daha fazla bilgi almak için bir çocuk seçin - sağa kaydırın

# getChildAppUsage
source: Get to see our child live app usage
de: Hinweis zur Verwendung durch Kinder
es: Obtén información sobre el uso en vivo de la aplicación de tu hijo
fr: Consultez l'utilisation en direct
tr: Çocuğunuzun canlı uygulama kullanımını görüntüleyin

# clickForFullReport
source: Click on it to have the full report
de: Klicken Sie darauf, um den vollständigen Bericht zu erhalten
es: Haz clic para obtener el informe completo
fr: Cliquez dessus pour obtenir le rapport complet
tr: Tam rapor için tıklayın

source: Information Section
de: Informationsbereich
es: Sección de información
fr: Section d'informations
tr: Bilgi Bölümü

# informationSectionSub
source: Get tips on how to use the app.
de: Erhalten Sie Tipps zur Verwendung der App.
es: Obtén consejos sobre cómo utilizar la aplicación.
fr: Obtenez des conseils sur l'utilisation de l'application.
tr: Uygulamayı nasıl kullanacağınıza dair ipuçları alın.

source: Dashboard
es: Tablero de control
fr: Acceuil
tr: Kontrol Paneli

source: Location
de: Ort
es: Ubicación
fr: Emplacement
tr: Konum

source: Notification
de: Benachrichtigung
es: Notificación
tr: Bildirim

# infoMessageTitle
source: Get to know how to send messages and notifications to your child device.
de: Erfahren Sie, wie Sie Nachrichten und Benachrichtigungen an das Gerät Ihres Kindes senden können
es: Aprenda cómo enviar mensajes y notificaciones al dispositivo de su hijo..
fr: Apprenez comment envoyer des messages et des notifications à l'appareil de votre enfant.
tr: Çocuğunuzun cihazına nasıl mesajlar ve bildirimler göndereceğinizi öğrenin.

# infoMessageText
source: Aprenda cÃ³mo enviar mensajes y notificaciones al dispositivo de su hijo..
de: Erfahren Sie, wie Sie Nachrichten und Benachrichtigungen an das Gerät Ihres Kindes senden können. Eine effektive Kommunikation mit Ihrem Kind durch Nachrichten und Benachrichtigungen ist entscheidend, um in Verbindung zu bleiben und ihre Sicherheit und ihr Wohlbefinden zu gewährleisten. Hier ist ein Leitfaden, der Ihnen helfen soll, diesen Prozess zu navigieren und eine gesunde Kommunikationslinie aufrechtzuerhalten: Wählen Sie das richtige Medium: Entscheiden Sie sich für die geeignete Plattform, um Nachrichten und Benachrichtigungen an Ihr Kind zu senden. Es kann sich um eine sichere Messaging-App, das integrierte Nachrichtensystem des Geräts oder eine Familienkommunikations-App mit elterlicher Kontrolle handeln. Legen Sie Richtlinien und Erwartungen fest: Definieren Sie klare Kommunikationsrichtlinien. Besprechen Sie, wann es angebracht ist, Nachrichten zu senden, welche Art von Informationen übermittelt werden sollen und die erwartete Antwortzeit. Dies hilft dabei, Erwartungen zu verwalten und einen respektvollen Kommunikationsfluss aufrechtzuerhalten. Priorisieren Sie wichtige Informationen: Verwenden Sie Nachrichten und Benachrichtigungen hauptsächlich für wichtige Updates, Erinnerungen oder dringende Kommunikation. Vermeiden Sie übermäßige oder unnötige Nachrichten, die für Ihr Kind ablenkend oder überwältigend sein können. Verwenden Sie klare und präzise Sprache: Stellen Sie sicher, dass die Sprache in den Nachrichten klar und leicht verständlich ist. Vermeiden Sie die Verwendung von Fachjargon oder komplexen Begriffen, die Verwirrung verursachen könnten. Respektieren Sie Privatsphäre und Grenzen: Achten Sie auf die Privatsphäre Ihres Kindes. Vermeiden Sie aufdringliche oder übermäßig kontrollierende Nachrichten. Respektieren Sie ihren Raum und kommunizieren Sie in einer Weise, die Vertrauen und Verständnis zeigt. Um effektive Nachrichten und Benachrichtigungen zu senden: Ermutigen und unterstützen Sie: Verwenden Sie Nachrichten, um Ermutigung, Lob oder Motivation zu bieten. Teilen Sie positives Feedback, um ihr Selbstvertrauen zu stärken und ihre Erfolge anzuerkennen. Nutzen Sie geplante Nachrichten: Erwägen Sie das Planen von Nachrichten für wichtige Ereignisse, Erinnerungen an Aufgaben oder aufmunternde Worte. Geplante Nachrichten können ein nützliches Werkzeug sein, um eine konsistente Kommunikation aufrechtzuerhalten. Notfallbenachrichtigungen: Stellen Sie sicher, dass Sie ein klares System für Notfallbenachrichtigungen haben. Im Falle dringender Angelegenheiten sollten sowohl Sie als auch Ihr Kind wissen, wie die Kommunikation und die schnelle Reaktion funktionieren. Feedback und offener Dialog: Ermutigen Sie Ihr Kind, Feedback zur Art der Kommunikation zu geben. Halten Sie die Kommunikationswege offen, sodass sie ihre Gedanken und Präferenzen zur Nachrichtenübermittlung und Benachrichtigungen äußern können. Eine effektive Kommunikation mit Ihrem Kind durch Nachrichten und Benachrichtigungen ist entscheidend, um eine starke und gesunde Eltern-Kind-Beziehung aufrechtzuerhalten. Durch die Einhaltung dieser Richtlinien und Strategien wird ein positiver und respektvoller Kommunikationskanal gefördert.
es: Aprenda cómo enviar mensajes y notificaciones al dispositivo de su hijo. Comunicarse de manera efectiva con su hijo a través de mensajes y notificaciones es esencial para mantenerse conectado y garantizar su seguridad y bienestar. Aquí tiene una guía para ayudarle a navegar por este proceso y mantener una línea de comunicación saludable: Elija el Medio Adecuado: Decida la plataforma adecuada para enviar mensajes y notificaciones a su hijo. Puede ser una aplicación de mensajería segura, el sistema de mensajería integrado en el dispositivo o una aplicación de comunicación familiar diseñada para el control parental. Establezca Directrices y Expectativas: Establezca directrices claras para la comunicación. Discuta cuándo es apropiado enviar mensajes, el tipo de información a transmitir y el tiempo de respuesta esperado. Esto ayuda a gestionar las expectativas y mantener un flujo de comunicación respetuoso. Priorice la Información Importante: Utilice mensajes y notificaciones principalmente para actualizaciones importantes, recordatorios o comunicación urgente. Evite mensajes excesivos o innecesarios que puedan resultar distractivos o abrumadores para su hijo. Utilice un Lenguaje Claro y Conciso: Al redactar mensajes, asegúrese de que el lenguaje sea claro y fácil de entender para su hijo. Evite el uso de jerga o términos complejos que puedan causar confusión. Respete la Privacidad y los Límites: Sea consciente de la privacidad de su hijo. Evite mensajes invasivos o excesivamente controladores. Respete su espacio y comunique de una manera que demuestre confianza y comprensión. Para enviar mensajes y notificaciones eficaces: Sea Alentador y de Apoyo: Utilice mensajes para proporcionar aliento, elogios o motivación. Comparta comentarios positivos para aumentar su confianza y reconocer sus logros. Utilice Mensajes Programados: Considere la programación de mensajes para eventos importantes, recordatorios de tareas o palabras de aliento. Los mensajes programados pueden ser una herramienta útil para mantener una comunicación constante. Notificaciones de Emergencia: Asegúrese de tener un sistema claro para notificaciones de emergencia. En caso de asuntos urgentes, tanto usted como su hijo deben saber cómo comunicarse y responder de manera oportuna. Retroalimentación y Diálogo Abierto: Anime a su hijo a dar retroalimentación sobre la forma en que se comunican. Mantenga abiertas las líneas de comunicación, permitiéndoles expresar sus pensamientos y preferencias con respecto a los mensajes y notificaciones. Comunicarse de manera efectiva con su hijo a través de mensajes y notificaciones es crucial para mantener una relación positiva y respetuosa entre padres e hijos. Siguiendo estas pautas y estrategias, fomentará un canal de comunicación positivo y respetuoso
fr: Apprenez comment envoyer des messages et des notifications à l'appareil de votre enfant. Communiquer efficacement avec votre enfant grâce à des messages et des notifications est essentiel pour rester connecté et garantir sa sécurité et son bien-être. Voici un guide pour vous aider à naviguer dans ce processus et maintenir une ligne de communication saine : Choisissez le bon moyen : Déterminez la plateforme appropriée pour envoyer des messages et des notifications à votre enfant. Il peut s'agir d'une application de messagerie sécurisée, du système de messagerie intégré de l'appareil ou d'une application de communication familiale conçue pour les contrôles parentaux. Établissez des directives et des attentes : Définissez des directives claires pour la communication. Discutez du moment opportun pour envoyer des messages, du type d'informations à transmettre et du temps de réponse attendu. Cela aide à gérer les attentes et à maintenir un flux de communication respectueux. Priorisez les informations importantes : Utilisez les messages et les notifications principalement pour les mises à jour importantes, les rappels ou les communications urgentes. Évitez les messages excessifs ou inutiles qui pourraient être distractifs ou accablants pour votre enfant. Utilisez un langage clair et concis : Lors de la rédaction de messages, assurez-vous que le langage est clair et facile à comprendre pour votre enfant. Évitez d'utiliser des acronymes ou des termes complexes qui pourraient causer de la confusion. Respectez la vie privée et les limites : Soyez attentif à la vie privée de votre enfant. Évitez les messages envahissants ou excessivement contrôlants. Respectez leur espace et communiquez de manière à montrer la confiance et la compréhension. Pour envoyer des messages et des notifications efficaces : Soyez encourageant et de soutien : Utilisez les messages pour encourager, féliciter ou motiver. Partagez des retours positifs pour renforcer leur confiance et reconnaître leurs réalisations. Utilisez des messages planifiés : Pensez à planifier des messages pour des événements importants, des rappels de tâches ou des mots d'encouragement. Les messages planifiés peuvent être un outil utile pour maintenir une communication cohérente. Notifications d'urgence : Assurez-vous d'avoir un système clair en place pour les notifications d'urgence. En cas de questions urgentes, vous et votre enfant devriez savoir comment communiquer et répondre rapidement. Feedback et dialogue ouvert : Encouragez votre enfant à donner son avis sur la manière dont vous communiquez. Gardez les canaux de communication ouverts, leur permettant d'exprimer leurs pensées et leurs préférences concernant les messages et les notifications. Communiquer efficacement avec votre enfant grâce à des messages et des notifications est essentiel pour maintenir une relation parent-enfant forte et saine. En suivant ces directives et stratégies, vous contribuerez à favoriser un canal de communication positif et respectueux.
tr: Çocuğunuzun cihazına mesajlar ve bildirimler göndermeyi nasıl yapacağınızı öğrenin. Mesajlar ve bildirimler aracılığıyla çocuğunuzla etkili iletişim kurmak, bağlantıda kalmak ve onların güvenliğini ve refahını sağlamak için önemlidir. İşte bu süreci yönlendirmenize ve sağlıklı iletişim hattını sürdürmenize yardımcı olacak bir rehber: Doğru Ortamı Seçin: Çocuğunuza mesajlar ve bildirimler göndermek için uygun platformu seçin. Bu, güvenli bir mesajlaşma uygulaması, cihazın içinde bulunan mesajlaşma sistemi veya ebeveyn denetimleri için tasarlanmış aile iletişim uygulaması olabilir. Kurallar ve Beklentiler Belirleyin: İletişim için açık kurallar belirleyin. Mesaj göndermenin uygun olduğu zamanı, iletilmesi gereken bilgi türünü ve beklenen yanıt süresini tartışın. Bu, beklentileri yönetmeye ve saygılı bir iletişim akışını sürdürmeye yardımcı olur. Önemli Bilgilere Öncelik Verin: Mesajları ve bildirimleri öncelikle önemli güncellemeler, hatırlatmalar veya acil iletişim için kullanın. Çocuğunuz için dikkat dağıtıcı veya fazla mesajdan kaçının. Net ve Özlü Dil Kullanın: Mesajları yazarken dilin çocuğunuzun anlayabileceği kadar net ve basit olduğundan emin olun. Kafa karıştırabilecek argo veya karmaşık terimlerden kaçının. Gizliliği ve Sınırları Saygılayın: Çocuğunuzun gizliliğine dikkat edin. İstenmeyen veya aşırı kontrol eden mesajlardan kaçının. Onların alanına saygı gösterin ve güven ve anlayışı yansıtan bir iletişim şeklinde iletişim kurun. Etkili mesajlar ve bildirimler göndermek için: Cesaretlendirici ve Destekleyici Olun: Mesajları cesaretlendirme, övgü veya motivasyon sağlamak için kullanın. Özgüvenlerini artırmak ve başarılarını tanımak için pozitif geri bildirimler paylaşın. Zamanlanmış Mesajları Kullanın: Önemli etkinlikler, görev hatırlatmaları veya cesaretlendirme sözleri için mesajları zamanlayın. Zamanlanmış mesajlar, sü

# infoTitle
source: Get to know how to read and interpret the graphs that is a summary of how your child uses his device
de: „Lernen Sie, wie Sie die Diagramme lesen und interpretieren, die eine Zusammenfassung darüber darstellen, wie Ihr Kind sein Gerät nutzt.“
es: Conoce cómo leer e interpretar los gráficos que son un resumen de cómo tu hijo usa su dispositivo
fr: Apprenez à lire et interpréter les graphiques qui résument la façon dont votre enfant utilise son appareil
tr: Çocuğunuzun cihazını nasıl kullandığının özeti olan grafikleri nasıl okuyup yorumlayacağınızı öğrenin
